"""
===================================================================================================
Задание 5 (необязательное)
Дан поток логов по количеству просмотренных страниц для каждого пользователя. 
Вам необходимо написать алгоритм, который считает среднее значение просмотров на пользователя.
 Т. е. надо посчитать отношение суммы всех просмотров к количеству уникальных пользователей."""

stream = [
'2018-01-01,user1,3',
'2018-01-07,user1,4',
'2018-03-29,user1,1',
'2018-04-04,user1,13',
'2018-01-05,user2,7',
'2018-06-14,user3,4',
'2018-07-02,user3,10',
'2018-03-21,user4,19',
'2018-03-22,user4,4',
'2018-04-22,user4,8',
'2018-05-03,user4,9',
'2018-05-11,user4,11',
]

new_stream = []
for element in stream:
    new_stream.append(element.split(','))

users = []
views = 0
for element in new_stream:
    if element[1] not in users:
        users.append(element[1])
    views += int(element[2])
print("Среднее количество просмотров на уникального пользователя: ", round(views / len(users), 2) )


"""
==========================================================================================================
Задание 6 (необязательное)
Необходимо у пользователя запрашивать набор чисел разделенных пробелом. 
В результате в отсортированном порядке должны выводиться числа, которые повторяются в вводе более одного раза."""

numbers = input("Введите числа, разделенные пробелом: ").split(' ')
not_unique_numbers = []

for ind in range(0, len(numbers)):
    count = -1
    for number in numbers:
        if numbers[ind] == number:
            count += 1
    if count > 0 and int(numbers[ind]) not in not_unique_numbers:
        not_unique_numbers.append(int(numbers[ind]))
for number in sorted(not_unique_numbers):
    print(number, end=' ')